fix: added mermaid diagram
